#ifndef MANIP_H
#define MANIP_H

#include "matrix.h"

/**
 * Транспонирование матрицы
 * m - матрица
 * возвращает 0 в случае успеха, -1 в случае ошибки
 * (для квадратных матриц транспонирование выполняется на месте, для неквадратных выделяется новая память)
 */
int m_tr(matrix* m);

/**
 * Поменять местами две строки
 * m - матрица
 * i - индекс первой строки
 * j - индекс второй строки
 * возвращает 0 в случае успеха, -1 в случае ошибки
 */
int m_srow(matrix* m, size_t i, size_t j);

/**
 * Поменять местами два столбца
 * m - матрица
 * i - индекс первого столбца
 * j - индекс второго столбца
 * возвращает 0 в случае успеха, -1 в случае ошибки
 */
int m_scol(matrix* m, size_t i, size_t j);

/**
 * Умножает строку на скаляр
 * m - матрица
 * i - индекс строки
 * d - множитель
 * возвращает 0 в случае успеха, -1 в случае ошибки
 */
int m_rmul(matrix* m, size_t i, double d);

/**
 * Делит строку на скаляр
 * m - матрица
 * i - индекс строки
 * d - делитель
 * возвращает 0 в случае успеха, -1 в случае ошибки
 */
int m_rdiv(matrix* m, size_t i, double d);

/**
 * Добавить масштабированную строку к другой строке
 * m - матрица
 * to - индекс целевой строки
 * from - индекс исходной строки
 * coeff - коэффициент
 * Возвращает 0 в случае успеха, -1 в случае ошибки
 */
int m_radd(matrix* m, size_t to, size_t from, double coeff);

/**
 * Вычисляет норму матрицы (норму суммы строк)
 * m - матрица
 * возвращает норму матрицы или -1.0 в случае ошибки
 */
double m_norm(const matrix* m);

#endif